Pandas groupby operations require a few steps
---

1) Split

2) Apply

3) Combine

Perform a Split Step to begin

In [21]:
import pandas as pd

In [27]:
#Create a dataframe using dictionary 
df = {'Company':['GOOG','GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
      'Person':['Andrew', 'Billy', 'Manda', 'Alec', 'Jules', 'Eve'],
      'Sales':[287,30,232,823,120,432]}

In [41]:
# Cast as a PD dataframe
df = pd.DataFrame(df)
df

  Company  Person  Sales
0    GOOG  Andrew    287
1    GOOG   Billy     30
2    MSFT   Manda    232
3    MSFT    Alec    823
4      FB   Jules    120
5      FB     Eve    432

In [42]:
df.groupby('Company') # there needs to be a function call on the object. It is ready with the split and it waiting for the combine
df.groupby('Company').mean() # company is the name of a newly created index (a multi-index)

         Sales
Company
FB       276.0
GOOG     158.5
MSFT     527.5

In [43]:
df.groupby('Company').std() # Standard deviation

              Sales
Company
FB       220.617316
GOOG     181.726443
MSFT     417.900108

In [44]:
df.groupby('Company').sum()

         Sales
Company
FB         552
GOOG       317
MSFT      1055

In [45]:
df.groupby('Company').describe().T # Flips the columns and rows and get an easier to read dataframe

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   276.000000  158.500000  527.500000
      std    220.617316  181.726443  417.900108
      min    120.000000   30.000000  232.000000
      25%    198.000000   94.250000  379.750000
      50%    276.000000  158.500000  527.500000
      75%    354.000000  222.750000  675.250000
      max    432.000000  287.000000  823.000000

Apply a function - an aggregate function which takes in mutiple values and returns a single value